//Лабораторная работа №3
//Студент ИВТб20з-1 Ряжкин Дмитрий Андреевич
//20.04.2021

#include <stdio.h> 
#include <locale.h>
#include <math.h>

long int i_a, i_b, i_c, //Переменные для хранения коэффицентов, введённых пользователем
         i_check = 0;   //Переменная, предназначенная для определения типа уравнения

int main(void)
{   
    //Сообщаем компилятору, что хотим видеть в командной строке русские буквы вместо "крокозябр" 
    setlocale(LC_ALL, "Rus");
    printf("Программа, реализующая поиск корней квадратного уравнения a*x^2 + b*x + c = 0\n");
    printf("Введите значение коэффициента а:");
    scanf_s("%ld", &i_a);
    if (i_a != 0)
    {
        i_check = i_check + 1;
    }
    printf("Введите значение коэффициента b:");
    scanf_s("%ld", &i_b);
    if (i_b != 0)
    {
        i_check = i_check + 3;
    }
    printf("Введите значение коэффициента c:");
    scanf_s("%ld", &i_c);
    if (i_c != 0)
    {
        i_check = i_check + 5;
    }

    //Почему были выбранны именно эти числа? Они позволяют однозначно идентифицировать, какие именно данные
    //пользователь ввёл и не допустить повторений
    switch(i_check)
    {

    //a, b, c = 0
    case 0:
     {
        printf("\n\nВведено пустое уравнение (%d)*x^2 + (%d)*x + (%d)=0, т.к. коэффициент равны нулю!\n", i_a, i_b, i_c);
        break;
     }

    //a, b = 0  c <> 0
    case 5:
     {
        printf("\n\nВведено линейное уравнение (%d)*x^2 + (%d)*x + (%d)=0. Уравнение не имеет корней!\n", i_a, i_b, i_c);
        break;
     }

    //a<>0 b,c = 0
    case 1:
     {
        printf("\n\nВведено квадратное уравнение (%d)*x^2 + (%d)*x + (%d)=0\n", i_a, i_b, i_c);
        printf("Результат умножения: %d*x^2=0\n", i_a);
        printf("Корень уравнения равен: 0\n");
        break;
     }

    // a<>0, b = 0, c <> 0
    case 6:
     {
        printf("\n\nВведено квадратное уравнение (%d)*x^2 + (%d)*x + (%d)=0\n", i_a, i_b, i_c);
        double f_x1, f_x2;
        long int i_disc;
        i_disc = pow(i_b,2) - (4 * i_a * i_c);
        if (i_disc > 0)
        {
            f_x1 = (-1 * i_b - (sqrt(i_disc)))/(2 * i_a);
            f_x2 = (-1 * i_b + (sqrt(i_disc)))/(2 * i_a);
            printf("Корни квадратного уравнения: %f, %f\n", f_x1, f_x2);
            printf("Подставим x1 в исходное уравнение:\n");
            printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) + (%d) = 0 |->\n", i_a, f_x1, i_b, f_x1, i_c);
            printf("(%d)*(%2.2f) + (%d) = 0 |->\n", i_a, pow(f_x1, 2), i_c);
            printf("%1.0f=0\n\n", pow(f_x1, 2) * i_a +i_c);
            printf("Подставим x2 в исходное уравнение:\n");
            printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) + (%d) = 0 |->\n", i_a, f_x2, i_b, f_x2, i_c);
            printf("(%d)*(%2.2f) + (%d) = 0 |->\n", i_a, pow(f_x2, 2), i_c);
            printf("%1.0f=0\n", pow(f_x2, 2) * i_a + i_c);
        }
        else
        {
            printf("Данное уравнение не имеет корней, поскольку дискриминант меньше 0\n");
        }
        break;
     }

     //a, b <>0, c = 0 
    case 4:
     {
        printf("\n\nВведено квадратное уравнение (%d)*x^2 + (%d)*x + (%d)=0\n", i_a, i_b, i_c);
        double f_x1, f_x2;
        int i_disc;
        i_disc = pow(i_b, 2) - (4 * i_a * i_c);
        //Без проверки дискриминанта, т.к. C тут равно 0 и проверять смысла нет
        f_x1 = (-1 * i_b - (sqrt(i_disc))) / (2 * i_a);
        f_x2 = (-1 * i_b + (sqrt(i_disc))) / (2 * i_a);
        printf("Корни квадратного уравнения: %f, %f\n", f_x1, f_x2);
        printf("Подставим x1 в исходное уравнение:\n");
        printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) = 0 |->\n", i_a, f_x1, i_b, f_x1);
        printf("(%d)*(%2.2f) + (%2.2f) = 0 |->\n", i_a, pow(f_x1, 2), i_b * f_x1);
        printf("%1.0f=0\n\n", pow(f_x1, 2) * i_a + i_b* f_x1);
        printf("Подставим x2 в исходное уравнение:\n");
        printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) = 0 |->\n", i_a, f_x2, i_b, f_x2);
        printf("(%d)*(%2.2f) + (%2.2f) = 0 |->\n", i_a, pow(f_x2, 2), i_b * f_x2);
        printf("%1.0f=0\n", pow(f_x2, 2) * i_a + i_b * f_x2);
      
        break;
     }
    
     //a, b, c <> 0
    case 9:
     {
        printf("\n\nВведено квадратное уравнение (%d)*x^2 + (%d)*x + (%d)=0\n", i_a, i_b, i_c);
        double f_x1, f_x2;
        int i_disc;
        i_disc = pow(i_b, 2) - (4 * i_a * i_c);
        if (i_disc > 0)
        {
            f_x1 = (-1 * i_b - (sqrt(i_disc))) / (2 * i_a);
            f_x2 = (-1 * i_b + (sqrt(i_disc))) / (2 * i_a);
            printf("Корни квадратного уравнения: %f, %f\n", f_x1, f_x2);
            printf("Подставим x1 в исходное уравнение\n");
            printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) + (%d) = 0 |->\n", i_a, f_x1, i_b, f_x1, i_c);
            printf("(%d)*(%2.2f) + (%2.2f) + (%d) = 0 |->\n", i_a, pow(f_x1, 2), i_b * f_x1, i_c);
            printf("%1.0f=0\n\n", pow(f_x1, 2) * i_a + i_b * f_x1 + i_c);
            printf("Подставим x2 в исходное уравнение\n");
            printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) + (%d) = 0 |->\n", i_a, f_x2, i_b, f_x2, i_c);
            printf("(%d)*(%2.2f) + (%2.2f) + (%d) = 0 |->\n", i_a, pow(f_x2, 2), i_b * f_x2, i_c);
            printf("%1.0f=0\n", pow(f_x2, 2) * i_a + i_b * f_x2 + i_c);
        }
        else
        {
            if (i_disc == 0)
            {
                f_x1 = (-1 * i_b) / (2 * i_a);
                printf("Корень квадратного уравнения: %f\n", f_x1);
                printf("Подставим корень уравнения в исходное уравнение\n");
                printf("(%d)*(%2.2f)^2 + (%d)*(%2.2f) + (%d) = 0 |->\n", i_a, f_x1, i_b, f_x1, i_c);
                printf("(%d)*(%2.2f) + (%2.2f) + (%d) = 0 |->\n", i_a, pow(f_x1, 2), i_b * f_x1, i_c);
                printf("%1.0f=0\n", pow(f_x1, 2) * i_a + i_b * f_x1 + i_c);
            }
            else
            {
                printf("Данное уравнение не имеет корней, поскольку дискриминант меньше 0\n");
            }
            
        }
        break;
     }
    
     //Сделано на тот случай, если кто-то постарается ввести некорректные значения
    default:
        printf("Уравнение не соответствует условию задачи");
        break;

    }

    return(0);
}